In [2]:
import pandas as pd

In [3]:
import numpy as np

In [4]:
import matplotlib.pyplot as plt

In [4]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [5]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [5]:
dates = pd.date_range("20130101", periods = 6)

In [7]:
type(dates)

pandas.core.indexes.datetimes.DatetimeIndex

In [8]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
alpha_list = ["A", "B", "C", "D"]

In [7]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=alpha_list)

In [12]:
df

                   A         B         C         D
2013-01-01 -0.450037  0.234014 -1.347979 -0.029636
2013-01-02 -0.490206  1.591235 -0.218654  0.528848
2013-01-03  0.262390  1.678847  0.699385  0.245607
2013-01-04  0.291014 -0.194358  0.531101 -1.077829
2013-01-05 -0.311669  2.262297 -0.967999 -0.748578
2013-01-06  0.504474  1.440632  0.132111  1.821712

In [13]:
df2 = pd.DataFrame({"A": 1,
                    "B": pd.Timestamp("20130102"),
                    "C": pd.Series(1, index=list(range(4)), dtype="float32"),
                    "D": np.array([3] * 4, dtype="int32"),
                    "E": pd.Categorical(["test", "train", "test", "train"]),
                    "F": "foo"})

In [14]:
df2

   A          B    C  D      E    F
0  1 2013-01-02  1.0  3   test  foo
1  1 2013-01-02  1.0  3  train  foo
2  1 2013-01-02  1.0  3   test  foo
3  1 2013-01-02  1.0  3  train  foo

In [15]:
df2.dtypes

A             int64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [16]:
df.head()

                   A         B         C         D
2013-01-01 -0.450037  0.234014 -1.347979 -0.029636
2013-01-02 -0.490206  1.591235 -0.218654  0.528848
2013-01-03  0.262390  1.678847  0.699385  0.245607
2013-01-04  0.291014 -0.194358  0.531101 -1.077829
2013-01-05 -0.311669  2.262297 -0.967999 -0.748578

In [17]:
df.tail(3)

                   A         B         C         D
2013-01-04  0.291014 -0.194358  0.531101 -1.077829
2013-01-05 -0.311669  2.262297 -0.967999 -0.748578
2013-01-06  0.504474  1.440632  0.132111  1.821712

In [18]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [19]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [20]:
df.values

array([[-0.45003691,  0.23401376, -1.34797919, -0.02963649],
       [-0.49020629,  1.59123509, -0.21865429,  0.52884804],
       [ 0.26238977,  1.67884694,  0.6993853 ,  0.24560652],
       [ 0.29101358, -0.19435793,  0.53110081, -1.07782942],
       [-0.31166947,  2.26229705, -0.96799941, -0.74857778],
       [ 0.50447439,  1.4406322 ,  0.13211114,  1.82171186]])

In [21]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.032339  1.168778 -0.195339  0.123354
std    0.433988  0.942364  0.819951  1.028621
min   -0.490206 -0.194358 -1.347979 -1.077829
25%   -0.415445  0.535668 -0.780663 -0.568842
50%   -0.024640  1.515934 -0.043272  0.107985
75%    0.283858  1.656944  0.431353  0.458038
max    0.504474  2.262297  0.699385  1.821712

In [22]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.450037   -0.490206    0.262390    0.291014   -0.311669    0.504474
B    0.234014    1.591235    1.678847   -0.194358    2.262297    1.440632
C   -1.347979   -0.218654    0.699385    0.531101   -0.967999    0.132111
D   -0.029636    0.528848    0.245607   -1.077829   -0.748578    1.821712

In [23]:
df.sort_index(axis = 1, ascending = False)

                   D         C         B         A
2013-01-01 -0.029636 -1.347979  0.234014 -0.450037
2013-01-02  0.528848 -0.218654  1.591235 -0.490206
2013-01-03  0.245607  0.699385  1.678847  0.262390
2013-01-04 -1.077829  0.531101 -0.194358  0.291014
2013-01-05 -0.748578 -0.967999  2.262297 -0.311669
2013-01-06  1.821712  0.132111  1.440632  0.504474

In [24]:
df.sort_index(axis = 0, ascending = False)

                   A         B         C         D
2013-01-06  0.504474  1.440632  0.132111  1.821712
2013-01-05 -0.311669  2.262297 -0.967999 -0.748578
2013-01-04  0.291014 -0.194358  0.531101 -1.077829
2013-01-03  0.262390  1.678847  0.699385  0.245607
2013-01-02 -0.490206  1.591235 -0.218654  0.528848
2013-01-01 -0.450037  0.234014 -1.347979 -0.029636

In [25]:
df.sort_values(by = "A", ascending = True)

                   A         B         C         D
2013-01-02 -0.490206  1.591235 -0.218654  0.528848
2013-01-01 -0.450037  0.234014 -1.347979 -0.029636
2013-01-05 -0.311669  2.262297 -0.967999 -0.748578
2013-01-03  0.262390  1.678847  0.699385  0.245607
2013-01-04  0.291014 -0.194358  0.531101 -1.077829
2013-01-06  0.504474  1.440632  0.132111  1.821712

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      float64
 1   B       6 non-null      float64
 2   C       6 non-null      float64
 3   D       6 non-null      float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [27]:
df.isnull().sum()

A    0
B    0
C    0
D    0
dtype: int64

In [28]:
df["A"]

2013-01-01   -0.450037
2013-01-02   -0.490206
2013-01-03    0.262390
2013-01-04    0.291014
2013-01-05   -0.311669
2013-01-06    0.504474
Freq: D, Name: A, dtype: float64

In [14]:
df

                   A         B         C         D
2013-01-01 -0.305430  0.422610  1.199333 -0.456524
2013-01-02  0.204451 -2.096374  0.394123  0.269172
2013-01-03  0.545781  0.940720  1.492892 -0.103518
2013-01-04  0.357453 -0.386623  0.072913 -0.779368
2013-01-05  1.283410 -1.731825  0.511001 -0.495279
2013-01-06 -0.215752  0.055090 -0.449303  0.682188

In [19]:
temp_df = df[(df["A"] >= 0.4) & (df["B"] <= 0.)]
temp_df

                  A         B         C         D
2013-01-05  1.28341 -1.731825  0.511001 -0.495279

In [22]:
temp_df[["A", "B"]]

                  A         B
2013-01-05  1.28341 -1.731825